argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
  /* Loop over all keys of the root object */
  for (i = 1; i < r; i++) {
          if (jsoneq(JSON_STRING, &t[i], "user") == 0) {
                  /* We may use strndup() to fetch string value */
                  cli_printf("- User: %.*s\r\n", t[i+1].end-t[i+1].start,
                                  JSON_STRING + t[i+1].start);
                  i++;
          } else if (jsoneq(JSON_STRING, &t[i], "admin") == 0) {
                  /* We may additionally check if the value is either "true" or "false" */
                  cli_printf("- Admin: %.*s\r\n", t[i+1].end-t[i+1].start,
                                  JSON_STRING + t[i+1].start);
                  i++;
          } else if (jsoneq(JSON_STRING, &t[i], "uid") == 0) {
                  /* We may want to do strtol() here to get numeric value */
                  cli_printf("- UID: %.*s\r\n", t[i+1].end-t[i+1].start,
                                  JSON_STRING + t[i+1].start);
                  i++;
          } else if (jsoneq(JSON_STRING, &t[i], "groups") == 0) {
                  int j;
                  cli_printf("- Groups:\r\n");
                  if (t[i+1].type != JSMN_ARRAY) {
                          continue; /* We expect groups to be an array of strings */
                  }
                  for (j = 0; j < t[i+1].size; j++) {
                          jsmntok_t *g = &t[i+j+2];
                          cli_printf("  * %.*s\r\n", g->end - g->start, JSON_STRING + g->start);
                  }
                  i += t[i+1].size + 1;
          } else {
                  cli_printf("Unexpected key: %.*s\r\n", t[i].end-t[i].start,
                                  JSON_STRING + t[i].start);
          }
  }
  
  /* Infinite loop */
  for(;;)
  {
    osDelay(1);
  }
  /* USER CODE END StartSDTask */
}

/* USER CODE BEGIN Header_StartLWIPTask */
/**
* @brief Function implementing the lwipTask thread.
* @param argument: Not used
* @retval None
*/
portCHAR PAGE_BODY[256];

/* USER CODE END Header_StartLWIPTask */
void StartLWIPTask(void const * argument)
{
  /* USER CODE BEGIN StartLWIPTask */
  struct netif* netif = (struct netif*)argument;
  struct netconn *conn;
  err_t err;
  uint8_t data = 0;
  
  /* netconn_recv buffer variables */
  struct netbuf *netbuf = NULL;
  uint16_t buf_len = 0;
  void* buf_data = NULL;
  
  uint8_t iptxt[64];
  uint8_t http_body[128];
  uint8_t http_body_length[4];
  
  ip4_addr_t local_ip; 
  ip4_addr_t remote_ip; 
  
  const char* key = "WTN6FH385TCUNDMU";
  
  const char* server = "thingspeak.com";
  const char* url = "/update.json";
  const char* content_type = "application/json";
  
  const char* json_data_fmt = "{\"api_key\": \"%s\", \"delta_t\": %d, \"field1\": %d}";
  
  char myBuilder_buf[256];

  /* init code for LWIP */
  MX_LWIP_Init();
  
  /* Check interface status */
  if (netif_is_up(netif))
  {
    DHCP_state = DHCP_START;
  }
  else
  {  
    DHCP_state = DHCP_LINK_DOWN;
    cli_printf("The network cable is not connected \r\n");
  }

  /* Infinite loop */
  for(;;)
  {
    if(xQueueReceive(tcpQueueHandle, &data, 0) == pdTRUE)
    {
      cli_printf("[Queue] Model -> %s (data = %u)\r\n", __func__, data);

      if (DHCP_state == DHCP_ADDRESS_ASSIGNED)
      {
        /* Create a new TCP connection handle */
        conn = netconn_new(NETCONN_TCP);        
        if (conn == NULL)
        {
          cli_printf("[LWIP] netconn_new : FAILED\r\n");
        }
        else
        {
#if 0 
          /* Bind a netconn to a specific local IP address and port (optional) */
          err = netconn_bind(conn, &netif->ip_addr, 0 );
          if (err != ERR_OK)
          {
            cli_printf("[LWIP] netconn_bind: ERR (%d)\r\n", err);
          }
          else
#endif
          {
            err = netconn_gethostbyname(server, &remote_ip);
            if (err != ERR_OK)
            {
              cli_printf("[LWIP] netconn_gethostbyname: ERR (%d)\r\n", err);
            }
            else
            {
              sprintf((char *)iptxt, "%s", ip4addr_ntoa((const ip4_addr_t *)&remote_ip));   
              cli_printf("Remote IP address to server: %s (%s)\r\n", server, iptxt);
              
              /* Connect to server */
              err = netconn_connect(conn, &remote_ip, 80); 
              if (err != ERR_OK)
              {
                cli_printf("[LWIP] netconn_connect: ERR (%d)\r\n", err);
              }
              else
              {
                cli_printf("Connected to server: %s\r\n", server);
                
                sprintf((char *)http_body, json_data_fmt, key, 5, data);  
                sprintf((char *)http_body_length, "%d", strlen((char *)http_body));  
                
                lwhttp_new_builder(&myBuilder, (char*)myBuilder_buf, sizeof(myBuilder_buf));
                lwhttp_add_request(&myBuilder, LwHHTP_POST, url);
                lwhttp_add_header(&myBuilder, "Content-Type", content_type);
                lwhttp_add_header(&myBuilder, "Content-Length", (char *)http_body_length);
                lwhttp_add_body(&myBuilder, (char*)http_body, strlen((char *)http_body));
                lwhttp_end(&myBuilder);
                
                /* Write data to server */
                err = netconn_write(conn, myBuilder.data, myBuilder.len, NETCONN_NOFLAG);
                if (err != ERR_OK)
                {
                  cli_printf("[LWIP] netconn_write: ERR (%d)\r\n", err);
                }
                else
                {
                  cli_printf("\r\n[LWIP] netconn_write:\r\n\r\n%s", myBuilder.data);
                  cli_printf("\r\n[LWIP] netconn_recv:\r\n\r\n");
                  
                  /* Get pointer to buffer where response data is stored */
                  while (( err = netconn_recv(conn, &netbuf)) == ERR_OK)
                  {
                      do
                      {
                        /* Get pointer to data and length*/
                        netbuf_data(netbuf, &buf_data, &buf_len);
                        
                        /* Print data to console */
                        cli_write((char*)buf_data, buf_len);
                      }
                      while (netbuf_next(netbuf) >= 0);
                      
                      /* Free data buffer */
                      netbuf_delete(netbuf);
                  }
                  
                  cli_printf("\r\n");
                  
                  if ((err != ERR_OK) && (err != ERR_CLSD))
                  {
                    cli_printf("[LWIP] netconn_recv: ERR (%d)\r\n", err);
                  }
                }
                
                /* Close connection from local side */
                err = netconn_close(conn);
                if (err != ERR_OK)
                {
                  cli_printf("[LWIP] netconn_close: ERR (%d)\r\n", err);
                }
              }
            }
          }
        }

        /* Delete TCP connection */
        err = netconn_delete(conn);  
        if (err != ERR_OK)
        {
          cli_printf("[LWIP] netconn_close: ERR (%d)\r\n", err);
        }
      }
    }
    
    osDelay(10);
  }
  /* USER CODE END StartLWIPTask */
}

/* USER CODE BEGIN Header_StartDHCPTask */
/**
* @brief Function implementing the dhcpTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartDHCPTask */
void StartDHCPTask(void const * argument)
{
  /* USER CODE BEGIN StartDHCPTask */

  struct netif* netif = (struct netif*)argument;
  ip_addr_t ipaddr;
  ip_addr_t netmask;
  ip_addr_t gw;
  struct dhcp *dhcp;
  uint8_t iptxt[20];
  
  /* Get DHCP instance */
  dhcp = (struct dhcp *)netif_get_client_data(netif, LWIP_NETIF_CLIENT_DATA_INDEX_DHCP);
  
  for (;;)
  {
    switch (DHCP_state)
    {
    case DHCP_START:
      {
        ip_addr_set_zero_ip4(&netif->ip_addr);
        ip_addr_set_zero_ip4(&netif->netmask);
        ip_addr_set_zero_ip4(&netif->gw);       
        dhcp_start(netif);
        DHCP_state = DHCP_WAIT_ADDRESS;
        cli_printf("[DHCP] Looking for server ...\r\n");
      }
      break;
      
    case DHCP_WAIT_ADDRESS:
      {                
        if (dhcp_supplied_address(netif)) 
        {
          DHCP_state = DHCP_ADDRESS_ASSIGNED;	
          sprintf((char *)iptxt, "%s", ip4addr_ntoa((const ip4_addr_t *)&netif->ip_addr));   
          cli_printf("[DHCP] Supplied address: %s\r\n", iptxt);
        }
        else
        {
          dhcp = (struct dhcp *)netif_get_client_data(netif, LWIP_NETIF_CLIENT_DATA_INDEX_DHCP);
    
          /* DHCP timeout */
          if (dhcp->tries > MAX_DHCP_TRIES)
          {
            DHCP_state = DHCP_TIMEOUT;
            
